src/СРМ/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>ВидКорректировки</name>
    <type>
      <types>EnumRef.ВидКорректировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКоректировкаДолга</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорИсточник</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КБКИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВзаиморасчетов</name>
    <type>
      <types>EnumRef.ТипыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсточник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеренесенИз77</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьЧерезСторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СдвигатьДатуПоследнегоНачисления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/СРМ/src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами/ВзаиморасчетыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСКонтрагентами</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВзаиморасчета</name>
    <type>
      <types>EnumRef.ТипыВзаиморасчетов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/СРМ/src/Enums/ВидыОперацийКоректировкаДолга/ВидыОперацийКоректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКоректировкаДолга</name>
  <enumValues>
    <name>КорректировкаДолга</name>
  </enumValues>
  <enumValues>
    <name>ПеренесениеДолга</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Enums/ВидКорректировки/ВидКорректировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидКорректировки</name>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>Начисления</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/КорректировкаДолга/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыСКонтрагентами.Очистить();
	Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
	
	Если ВидОперации=Перечисления.ВидыОперацийКоректировкаДолга.ПеренесениеДолга Тогда
		
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		
		Если КорректироватьЧерезСторно Тогда
			Знак = -1;
			Если ВидКорректировки=Перечисления.ВидКорректировки.Начисления Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
		Иначе
			Знак = 1;
			Если ВидКорректировки=Перечисления.ВидКорректировки.Начисления Тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			КонецЕсли;
		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.ДоговорКонтрагента = ДоговорИсточник;
		Движение.ТипВзаиморасчета = ТипВзаиморасчетов;
		Движение.КБК = КБКИсточник;
		Движение.Контрагент = КонтрагентИсточник;
		Движение.Сумма = Знак*Сумма;
	КонецЕсли;
	
	Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
	Если ВидКорректировки=Перечисления.ВидКорректировки.Начисления Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.Период = Дата;
	Движение.ДоговорКонтрагента = Договор;
	Движение.ТипВзаиморасчета = ТипВзаиморасчетов;
	Движение.КБК = КБК;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;

КонецПроцедуры                                                   

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения=Неопределено Тогда
		ВидОперации=Перечисления.ВидыОперацийКоректировкаДолга.КорректировкаДолга;
		ВидКорректировки=Перечисления.ВидКорректировки.Начисления;
		КорректируемыйМесяц=НачалоМесяца(ТекущаяДата());
		Биллинг.ПриВводеНовогоЗаполнитьОрганизацию(ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры
